---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManagerIterator.Reset
source: html/364c78bc-bc2f-53e4-13d6-47dc11ce3472.htm
---
# Autodesk.Revit.DB.Macros.MacroManagerIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```